/**
 * DSA: Backtracking
 * Leetcode Problem 39. Combination Sum
 * ব্যাখাঃ এই সমস্যাটিতে আমাদের একটি ইন্টিজার অ্যারে এবং একটি টার্গেট মান দেওয়া হয়। আমাদের সেই অ্যারের সব সম্ভাব্য কম্বিনেশন বের করতে হবে যা টার্গেট মানের সমান হয়। একটি কম্বিনেশন হল মূল অ্যারের এমন একটি সেট যা মূল অ্যারের উপাদানগুলির একটি অংশ হতে পারে এবং একই উপাদান একাধিকবার ব্যবহার করা যেতে পারে। উদাহরণস্বরূপ, যদি আমাদের অ্যারে [2, 3] এবং টার্গেট 7 হয়, তবে তার কম্বিনেশনগুলি হবে [2, 2, 3]।
 * সমাধানঃ এই সমস্যাটির সমাধান করার জন্য আমরা ব্যাকট্র্যাকিং ব্যবহার করতে পারি। আমরা একটি রিকার্সিভ ফাংশন তৈরি করব যা প্রতিটি উপাদানকে পিক বা আনপিক করার সিদ্ধান্ত নেবে। যখন আমরা একটি উপাদানকে পিক করি, তখন আমরা সেটি আমাদের কম্বিনেশনের অংশ হিসাবে যোগ করব এবং রিকার্সিভ কল করব একই উপাদানের জন্য কারণ একই উপাদান একাধিকবার ব্যবহার করা যেতে পারে। যখন আমরা একটি উপাদানকে আনপিক করি, তখন আমরা সেটি কম্বিনেশন থেকে সরিয়ে ফেলব এবং আবার রিকার্সিভ কল করব পরবর্তী উপাদানের জন্য। এইভাবে, আমরা সব সম্ভাব্য কম্বিনেশন তৈরি করতে পারব।
 * টাইম কমপ্লেক্সিটি: O(2^n) কারণ প্রতিটি উপাদানকে পিক বা আনপিক করার দুটি সম্ভাবনা রয়েছে, এবং n উপাদানের জন্য মোট 2^n কম্বিনেশন তৈরি হতে পারে।
 * স্পেস কমপ্লেক্সিটি: O(n) কারণ রিকার্সিভ কল স্ট্যাকের গভীরতা সর্বোচ্চ n হতে পারে, যেখানে n হল অ্যারের দৈর্ঘ্য।
 */


class Solution {
public:
    vector<vector<int>> combinationSum(vector<int>& candidates, int target) {
        vector<vector<int>> ans;
        vector <int> arr;
        solve(0, candidates, target, arr, ans);
        return ans;
    }

    void solve(int idx, vector<int>& candidates, int target, vector <int> &arr, vector<vector<int>> &ans) {
        if(target ==  0) {
            ans.push_back(arr);
            return;
        }

        if(idx == candidates.size() or target < 0) return;

        //pick
        if(candidates[idx] <= target) {
            arr.push_back(candidates[idx]);
            solve(idx, candidates, target-candidates[idx], arr, ans);
            arr.pop_back();
        }

        //unpick
        solve(idx+1, candidates, target, arr, ans);
    }
};