/**
 * Leetcode Problem 78. Subsets
 * https://leetcode.com/problems/subsets/
 * DSA : Backtracking
 * ব্যাখ্যা: এই সমস্যাটিতে আমাদের একটি ইন্টিজার অ্যারে দেওয়া হয় এবং আমাদের সেই অ্যারের সব সম্ভাব্য সাবসেট বের করতে হবে। একটি সাবসেট হল মূল অ্যারের এমন একটি সেট যা মূল অ্যারের উপাদানগুলির একটি অংশ বা সমগ্র হতে পারে। উদাহরণস্বরূপ, যদি আমাদের অ্যারে [1, 2] হয়, তবে তার সাবসেটগুলি হবে [], [1], [2], এবং [1, 2]।

 * সমাধান: এই সমস্যাটির সমাধান করার জন্য আমরা ব্যাকট্র্যাকিং ব্যবহার করতে পারি। আমরা একটি রিকার্সিভ ফাংশন তৈরি করব যা প্রতিটি উপাদানকে পিক বা আনপিক করার সিদ্ধান্ত নেবে। যখন আমরা একটি উপাদানকে পিক করি, তখন আমরা সেটি আমাদের সাবসেটের অংশ হিসাবে যোগ করব এবং রিকার্সিভ কল করব পরবর্তী উপাদানের জন্য। যখন আমরা একটি উপাদানকে আনপিক করি, তখন আমরা সেটি সাবসেট থেকে সরিয়ে ফেলব এবং আবার রিকার্সিভ কল করব পরবর্তী উপাদানের জন্য। এইভাবে, আমরা সব সম্ভাব্য সাবসেট তৈরি করতে পারব।

 * টাইম কমপ্লেক্সিটি: O(2^n) কারণ প্রতিটি উপাদানকে পিক বা আনপিক করার দুটি সম্ভাবনা রয়েছে, এবং n উপাদানের জন্য মোট 2^n সাবসেট তৈরি হতে পারে।

 * স্পেস কমপ্লেক্সিটি: O(n) কারণ রিকার্সিভ কল স্ট্যাকের গভীরতা সর্বোচ্চ n হতে পারে, যেখানে n হল অ্যারের দৈর্ঘ্য।
 */
class Solution {
public:
    vector<vector<int>> subsets(vector<int>& nums) {
        vector<vector<int>> ans;
        vector<int> arr;
        solve(0, nums, arr, ans);
        return ans;
    }

    void solve(int idx, vector<int> &nums, vector<int> &arr, vector<vector<int>> &ans) {
        if(idx == nums.size()) {
            ans.push_back(arr);
            return;
        }

        //pick
        arr.push_back(nums[idx]);
        solve(idx+1, nums, arr, ans);

        //unpick
        arr.pop_back();
        solve(idx+1, nums, arr, ans);
    }
};